backend/app/controllers/api/paths_controller.rb

  def index
    paths = Path.includes(units: :lessons) # Eager load units and lessons
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."unit_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["unit_id", 1], ["unit_id", 2], ["unit_id", 3], ["unit_id", 4], ["unit_id", 5], ["unit_id", 6], ["unit_id", 7], ["unit_id", 8], ["unit_id", 9], ["unit_id", 10]]
SELECT "paths".* FROM "paths"

  def show
    path = Path.includes(units: :lessons).find_by!(slug: params[:slug]) # Find by slug
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."unit_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["unit_id", 1], ["unit_id", 2], ["unit_id", 3], ["unit_id", 4], ["unit_id", 5], ["unit_id", 6], ["unit_id", 7], ["unit_id", 8], ["unit_id", 9], ["unit_id", 10]]
SELECT "paths".* FROM "paths" WHERE "paths"."slug" = ? LIMIT ?  [["slug", "coded-obbies"], ["LIMIT", 1]]