backend/app/controllers/users/sessions_controller.rb

  def respond_to_on_destroy
    authorization_header = request.headers['Authorization']
    token = authorization_header.split(' ').last if authorization_header

    Rails.logger.info "Authorization Header: #{authorization_header}"
    Rails.logger.info "JWT Token: #{token}"

    # Decode the token manually to inspect its jti and user ID
    begin
      secret = Rails.application.credentials.fetch(:secret_key_base)
      decoded_token = JWT.decode(token, secret, true, algorithm: 'HS256')
      payload = decoded_token.first

      Rails.logger.info "Decoded Payload: #{payload}"
      Rails.logger.info "Payload jti: #{payload['jti']}"
      Rails.logger.info "Payload sub: #{payload['sub']}"

      # Find the user and compare the jti
      user = User.find_by(id: payload['sub'])
      if user && user.jti == payload['jti']
        # Revoke the token by updating the jti
        user.update!(jti: SecureRandom.uuid)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "jti" = ? WHERE "users"."id" = ?  [["updated_at", "2024-12-21 20:02:08.362303"], ["jti", "4dd3ab1b-e9f1-41f6-a8e6-59c6b971aa9b"], ["id", 3]]